/*
Домашка:

1.  Ви прийшли в Макдональдз з трьома друзями.
    Всі вони хочуть зʼїсти гамбургер. Ви хочете зʼїсти гамбургер з картоплею.
    Реалізувати код, який буде перевіряти, що якщо всім вистачає гамбургерів і картоплі,
    то виводити текст "Ми поїли" в консоль. Якщо на всіх не вистачає їжі,
    то виводити в консоль текст "Ми йдемо в інше кафе"
    (Змінні типу інтеджер містять кількість продуктів в наявності у вигляді вхідних даних)
    

2.  Напишіть умовну конструкцію if, що перевіряє, чи знаходиться значення ціни товару між 1000 та 1900 включно.
    Результат виводити в консоль.

3.  Напишіть конструкцію if, щоб перевіряє, чи значення ціни товару не знаходиться між 1000 та 1900 включно.
    Реалізуйте два варіанти, один з оператором НЕ !, а інший без цього оператора.
    Результат виводити в консоль.

4.  За номером пори року вивести назву цієї пори року використовуючи оператор if-else-if
    Результат виводити в консоль.

5.  Задано 3 числа (a, b, c), які не рівні між собою.
    Визначити середнє мід цими трьома числами
    (не середнє арифметичне значення, а яке з трьох заданих чисел среднє за значенням) використовуючи оператор if-else.
    Використати вкладені оператори if
    Результат виводити в консоль.

6.  Задано номер дня тижня.
    За заданим номером вивести назву дня тижня використовуючи switch.
    Результат виводити в консоль.

7.  За допомогою switch реалізуйте обчислення виразу, передаючи у switch, як параметр, символ математичної операції.
    Математичні операції для обчислення: "+", "-", "*", "/".
    Результат виводити в консоль.

8.*  Використовуючи властивості рядків (тип string), та регулярний вираз (regular expression) видалити голосні букви зі слова.

9.*  Використовуючи оператор if реалізувати логіку переводу метрів в кілометри,
    так щоб в консоль виводився результат обчислень з правильним закінченням.
    Наприклад: 1000 метрів це 1 кілометр;  32 метри це 0,032 кілометра і т.д.

    Підказка(https://ukr-lifehacks.ed-era.com/rozdil-9/zvyazok_chislivnykiv)
*/
____________________________________________________
//1 завдання
let hamburgers = 3;
let fries = 1;
if(hamburgers >= 4&&fries >= 1 ){
    console.log('Ми поїли');
} else {
    console.log('Ми йдемо в інше кафе');
};
____________________________________________________
//2 завдання
let number = 999;

(number >= 1000&& number <= 1900) ? console.log('число підходить') : console.log('виберіть інше число')
__________________________________________________
//3 завдання
let number1 = 100;

(number1 >= 1000&&number1 <= 1900) ? console.log('ціни товару знаходиться між 1000 та 1900 включно') : console.log('ціни товару не знаходиться між 1000 та 1900 включно')

let num2 = 999

if (!(num2 < 1000 || num2 > 1900)){
    console.log('Значення знаходиться в ціновому діапазоні')    
} 
else if(num2 > 1000 || num2 < 1900){
    console.log('Значення не знаходиться в ціновому діапазоні')
}
___________________________________________________
//4 завдання
let winter = 1;
let spring = 2;
let summer = 3;
let autumn = 4;

if(spring===1){
    console.log('перша пора року')   
} else if(spring===2){
    console.log('друга пора року')
} else if(spring===3){
    console.log('третя пора року')
} else if(spring==4){
    console.log('четверта пора')
}
________________________________________________________________________________________

//5 завдання
let a = 3;
let b = 2;
let c = 1;
let avg;

if (a > b) {
  if (a > c) {
    if (b > c) {
        avg = b
        console.log(b, '- середнє число')  
    } 
    else
        avg = c
    console.log(c, '- не середнє число')
  }
  else 
    avg = a
  console.log(a, '- не середнє число')  

}
______________________________________
//6 завдання

let Wednesday = 3;

switch(Wednesday){
    case 1:
        console.log('Monday');
        break;
    case 2:
        console.log('Tuesday');
        break;    
    case 3:
        console.log('today is Wednesday');
        break;
    case 4:
        console.log('Thursday');
        break; 
    case 5:
        console.log('Friday');
        break;
    case 6:
        console.log('Saturday');
        break;
    case 7:
        console.log('Sunday');
        break;                                    
};
_________________________________________________________________________________________________
// ????????????

//7 завдання
let param1 = '+';
let param2 = '-';
let param3 = '*';
let param4 = '/';


switch(param2){
    case param1:
        console.log(`a ${param1} b = `);
    break;    
    case param2:
        console.log(`24 ${param2} 12`);
    break;
    case param3:
        console.log(`17 ${param3} 4`);
    break;
    case param4:
        console.log(`10 ${param4} 5`);
    break;   
}
______________________________________________________________________________________________________________________________
//8 задвання
let str = 'regular expression';
str = str.replace(/[aeiouy]/gi, '');
console.log(str)
______________________________________________________________________________________________________________________________
//???????????????????????

//9 завдання
let input = 97;
let input1 = 0.097;
let result = 'метрів';
let result1 = 'кілометрів';
if (input===input1){
    console.log(input, result ,'=', input1, result1)    
} else{
    console.log('введіть рівні числа')
}

____________________________________________________________
let metr = 3
let kilometr = metr/1000

if(metr === 1){
    console.log(metr, 'метр')
}else if (metr === 2||metr === 3||metr ===4){
    console.log(metr, 'метри')
}else if(metr === 5||metr === 6){
    console.log(metr, 'метрів')
}

let metr1 = 3000
let kilometr1 = metr1/1000

if(kilometr1 === 1){
    console.log(kilometr1, 'кілометр')
}else if (kilometr1 === 2||kilometr1 === 3||kilometr1 ===4){
    console.log(kilometr1, 'кілометри')
}else if(kilometr1 === 5||kilometr1 === 6){
    console.log (kilometr1, 'кілометрів')
}
__________________________________________________________________________________



